Kozurofu-San/kozurofu-drivers/platforms/STM32F4/SystemDriver.h
#pragma once

#include "interface/System.h"

#include "stm32f4xx.h"
#include <cstdint>
#include <cstddef>

extern "C" {
    void* _sbrk(int);
    extern char _end;     // конец .bss
    extern char _estack;  // верх RAM
}

namespace driver
{

class SystemDriver : public ISystem
{
    public:

    ResetReason getValue() override
    {
        ResetReason ret;
        uint32_t reason = RCC-> CSR;

        if      ( reason & RCC_CSR_PORRSTF)  { ret = ResetReason::PowerOn   ; _reasonIdx = 0; }
        else if ( reason & RCC_CSR_LPWRRSTF) { ret = ResetReason::Brownout  ; _reasonIdx = 1; }
        else if ( reason & RCC_CSR_BORRSTF)  { ret = ResetReason::Brownout  ; _reasonIdx = 1; }
        else if ( reason & RCC_CSR_IWDGRSTF) { ret = ResetReason::IndWdt    ; _reasonIdx = 2; }
        else if ( reason & RCC_CSR_WWDGRSTF) { ret = ResetReason::WinWdt    ; _reasonIdx = 3; }
        else if ( reason & RCC_CSR_SFTRSTF)  { ret = ResetReason::Sw        ; _reasonIdx = 4; }
        else if ( reason & RCC_CSR_PINRSTF)  { ret = ResetReason::Ext       ; _reasonIdx = 5; }
        else                                 { ret = ResetReason::Unknown   ; _reasonIdx = 6; }

        return ret;
    }

    const std::string_view& getString() override
    {
        getValue();
        return resetReasonString[_reasonIdx];
    }

    inline uint32_t getCpuSpeed() override
    {
        return SystemCoreClock;
    }
    
    uint64_t getChipId() override
    {
        return static_cast<uint64_t>(DBGMCU->IDCODE);
    }
    
    void restart() override
    {
        NVIC_SystemReset();
    }
    
    void updateMemoryInfo() override
    {
        char stack_ptr;

        _memoryInfo.ramEnd   = &_estack;
        _memoryInfo.dataEnd  = &_end;
        _memoryInfo.heapEnd  = (char*)_sbrk(0);
        _memoryInfo.stackPtr = &stack_ptr;
        _memoryInfo.ramFree  = _memoryInfo.stackPtr - _memoryInfo.heapEnd;
        
        _memoryInfo.heapStackCollision = (_memoryInfo.heapEnd >= _memoryInfo.stackPtr);
    
        _memoryInfo.usedHeap  = _memoryInfo.heapEnd - _memoryInfo.dataEnd;
        _memoryInfo.usedStack = _memoryInfo.ramEnd - _memoryInfo.stackPtr;
    }
    
    inline int32_t getFreeMemory() override
    {
        updateMemoryInfo();
        return _memoryInfo.ramFree;
    }
    
    inline int32_t getUsedHeap() override
    {
        updateMemoryInfo();
        return _memoryInfo.usedHeap;
    }
    
    inline int32_t getUsedStack() override
    {
        updateMemoryInfo();
        return _memoryInfo.usedStack;
    }

    private:

    static constexpr std::array<std::string_view, 7> resetReasonString =
    {
        "PowerOn",
        "Brownout",
        "IndWdt",
        "WinWdt",
        "Sw",
        "Ext",
        "Unknown"
    };

    MemoryInfo _memoryInfo;
    size_t _reasonIdx;
};

}